# IsRoomLocated Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanCircuit..::..IsRoomLocated Property
PlanCircuit Class See Also
---
Reports whether there is a room located in this circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsRoomLocated { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsRoomLocated As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsRoomLocated {
	bool get ();
}
```

# ### Field Value
True if there is a room located in this circuit on the circuit's level, false if there is no room located in this circuit on the circuit's level.
# See Also
PlanCircuit Class
Autodesk.Revit.DB Namespace